## production: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 14 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `github_actions_secret.account_id`                             |
|        | `github_actions_secret.aws_access_key_id[0]`                   |
|        | `github_actions_secret.aws_secret_access_key[0]`               |
|        | `github_actions_secret.manifests_account_id`                   |
|        | `github_actions_secret.manifests_aws_access_key_id[0]`         |
|        | `github_actions_secret.manifests_aws_secret_access_key[0]`     |
|        | `github_actions_secret.manifests_cache_clear_client_secret[0]` |
|        | `github_actions_secret.manifests_new_relic_api_key[0]`         |
|        | `github_actions_secret.manifests_notify_dev_slack_webhook[0]`  |
|        | `github_actions_secret.manifests_op_service_account_token[0]`  |
|        | `github_actions_secret.manifests_openai_api_key[0]`            |
|        | `github_actions_secret.notify_dev_slack_webhook[0]`            |
|        | `github_actions_secret.op_service_account_token[0]`            |
|        | `github_actions_secret.openai_api_key[0]`                      |
| delete | `github_repository.notification-terraform`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.account_id will be created
  + resource "github_actions_secret" "account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "PRODUCTION_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.aws_access_key_id[0] will be created
  + resource "github_actions_secret" "aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "PRODUCTION_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.aws_secret_access_key[0] will be created
  + resource "github_actions_secret" "aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "PRODUCTION_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_account_id will be created
  + resource "github_actions_secret" "manifests_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_aws_access_key_id[0] will be created
  + resource "github_actions_secret" "manifests_aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_aws_secret_access_key[0] will be created
  + resource "github_actions_secret" "manifests_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_cache_clear_client_secret[0] will be created
  + resource "github_actions_secret" "manifests_cache_clear_client_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_CACHE_CLEAR_CLIENT_SECRET"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_new_relic_api_key[0] will be created
  + resource "github_actions_secret" "manifests_new_relic_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "PRODUCTION_NEW_RELIC_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_notify_dev_slack_webhook[0] will be created
  + resource "github_actions_secret" "manifests_notify_dev_slack_webhook" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_op_service_account_token[0] will be created
  + resource "github_actions_secret" "manifests_op_service_account_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "OP_SERVICE_ACCOUNT_TOKEN_PRODUCTION"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.manifests_openai_api_key[0] will be created
  + resource "github_actions_secret" "manifests_openai_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-manifests"
      + secret_name     = "OPENAI_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.notify_dev_slack_webhook[0] will be created
  + resource "github_actions_secret" "notify_dev_slack_webhook" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "NOTIFY_PRODUCTION_SLACK_WEBHOOK"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.op_service_account_token[0] will be created
  + resource "github_actions_secret" "op_service_account_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "OP_SERVICE_ACCOUNT_TOKEN_PRODUCTION"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.openai_api_key[0] will be created
  + resource "github_actions_secret" "openai_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "notification-terraform"
      + secret_name     = "OPENAI_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_repository.notification-terraform will be destroyed
  # (because github_repository.notification-terraform is not in configuration)
  - resource "github_repository" "notification-terraform" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Terraform for notification.canada.ca" -> null
      - etag                        = "W/\"7312f7d6db62d44deb99bacabc94049fb3d176436fd58f09ba3875ae6e6e6084\"" -> null
      - full_name                   = "cds-snc/notification-terraform" -> null
      - git_clone_url               = "git://github.com/cds-snc/notification-terraform.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/cds-snc/notification-terraform" -> null
      - http_clone_url              = "https://github.com/cds-snc/notification-terraform.git" -> null
      - id                          = "notification-terraform" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "notification-terraform" -> null
      - node_id                     = "MDEwOlJlcG9zaXRvcnkzMDk0NzU5ODI=" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 309475982 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:cds-snc/notification-terraform.git" -> null
      - svn_url                     = "https://github.com/cds-snc/notification-terraform" -> null
      - topics                      = [
          - "notification-canada-ca",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }

Plan: 14 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
